app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2024-09-05 15:39:24.126270"], ["updated_at", "2024-09-05 15:39:24.126270"]]
---
  	def create
    	@article = Article.build(article_params)

    	if @article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Salut ca va ?"], ["body", "Moi aussi ca va bien"], ["updated_at", "2024-09-06 08:53:38.333934"], ["id", 21]]
---
  	def update
  		if @article.update(article_params)