app/controllers/signup_controller.rb

  def create
    byebug
    user = User.new(user_params)
    if user.save
      payload  = { user_id: user.id }
      session = JWTSessions::Session.new(payload: payload, refresh_by_access_allowed: true)
      tokens = session.login

      response.set_cookie(JWTSessions.access_cookie,
                          value: tokens[:access],
                          httponly: true,
                          secure: Rails.env.production?)
      render json: { csrf: tokens[:csrf] }
    else
      render json: { error: user.errors.full_messages.join(' ') }, status: :unprocessable_entity
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "alexa@a.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-09-05 14:27:01.243908"], ["updated_at", "2024-09-05 14:27:01.243908"]]
SELECT "users".* FROM "users"